[
  {
    "id": 1,
    "name": "Marc-Andre ter Stegen",
    "position": "Goalkeeper",
    "image": "https://www.fcbarcelona.com/photo-resources/2022/07/01/825a4c6b-b8c4-413b-bc19-9c69330fb31f/jugador_fitxa-ter_stegen.jpg?width=470&height=470",
    "detail": {
      "appearance": 335,
      "cleansheets": 126,
      "saves": 780,
      "description": "A keeper with great reflexes and also excellent with the ball at his feet",
      "bio": "Marc-André ter Stegen signed for FC Barcelona in the summer of 2014 from Borussia Mönchengladbach. Born on 30 April 1992 in Mönchengladbach itself, the German did not take long to make his name as one Europe's most promising young goalkeepers."
    }
  },
  {
    "id": 26,
    "name": "Inaki Pena",
    "position": "Goalkeeper",
    "image": "https://www.fcbarcelona.com/photo-resources/2022/08/02/db879f0f-4cd9-4330-9236-3644ec8a524c/jugador_fitxa-inaki_pena.jpg?width=470&height=470",
    "detail": {
      "appearance": 0,
      "cleansheets": 0,
      "saves": 0,
      "description": "Iñaki Peña is a Barça-style goalkeeper: he reads the game well and can use his feet well",
      "bio": "Iñaki Peña signed for Alicante CF when he was just five years old. In 2009, Villarreal CF was interested in the precocious player, where he began to stand out, especially in 2011, when he was chosen as the best goalkeeper of the Arona tournament. Barça had its eye on him and a year later he came to the Masia."
    }
  },
  {
    "id": 2,
    "name": "Hector Bellerin",
    "position": "Defender",
    "image": "https://www.fcbarcelona.com/photo-resources/2022/09/06/5db4ee0c-00f5-4356-ba12-e8de417c68e3/jugador_fitxa-bellerin.jpg?width=470&height=470",
    "detail": {
      "appearance": 2,
      "goals": 0,
      "assists": 0,
      "description": "Fast, attacking right back with a great eye for the right pass",
      "bio": "An attacking full back but also a competent defender, Héctor Bellerín left Arsenal in the summer of 2022 to sign a one-year contract with Barça. Born on 19 March 1995, the full back was finally coming home. He had entered Barça Escola when he was just six and then got snapped up into the youth system proper, playing all the way up to U16 level."
    }
  },
  {
    "id": 3,
    "name": "Gerrard Pique",
    "position": "Defender",
    "image": "https://www.fcbarcelona.com/photo-resources/2022/07/01/7669289d-05d3-4cfb-891b-ca0cedec79fc/jugador_fitxa-pique.jpg?width=470&height=470",
    "detail": {
      "appearance": 608,
      "goals": 52,
      "assists": 7,
      "description": "Considered one of the best centre halves in the world, Gerard Piqué brings together character, class and strength in the air",
      "bio": "Gerard Piqué was born on 2 February 1987 and since that day he has been a club member of FC Barcelona. Since he was very young he has been involved with the club and when he was 10 years old he joined the youngest boys' team at the club at that time (U12 B)."
    }
  },
  {
    "id": 4,
    "name": "Ronald Araujo",
    "position": "Defender",
    "image": "https://www.fcbarcelona.com/photo-resources/2022/07/01/fd6dc8ad-4ce8-4a6b-806c-96386ec7aaa8/jugador_fitxa-araujo.jpg?width=470&height=470",
    "detail": {
      "appearance": 89,
      "goals": 6,
      "assists": 1,
      "description": "Uruguayan defender, strong in the air and capable with the ball at his feet",
      "bio": "Ronald Araujo was born in Rivera, Uruguay, on 7 March 1999. The young central defender began playing professionally for his hometown team, and later joined the lower categories at Rentistas in the Uruguayan Second Division."
    }
  },
  {
    "id": 15,
    "name": "Andreas Christensen",
    "position": "Defender",
    "image": "https://www.fcbarcelona.com/photo-resources/2022/07/12/382f08c8-1d66-466c-8ddf-3aad0a05ae02/jugador_fitxa-christensen.jpg?width=470&height=470",
    "detail": {
      "appearance": 4,
      "goals": 0,
      "assists": 0,
      "description": "Centre back with brilliant passing skills and a tremendous reading of the game. Fabulous and finding the right route to get the ball forward",
      "bio": "An excellent reader of the game and versatile centre back, Andreas Christensen (10 April 1996) was born in Lillerød (Denmark) where he started out at IF Skjold Birkerød, soon catching the eye of Brøndby IF."
    }
  },
  {
    "id": 17,
    "name": "Marcos Alonso",
    "position": "Defender",
    "image": "https://www.fcbarcelona.com/photo-resources/2022/09/06/26e82189-d7ab-45be-bfcf-a9240af8f75e/jugador_fitxa-marcos_a.jpg?width=470&height=470",
    "detail": {
      "appearance": 2,
      "goals": 0,
      "assists": 0,
      "description": "Skilful full back or sweeper with a fine left foot",
      "bio": "A full back who can also play as wing back and a threat from set pieces, Marcos Alson was born in Madrid on 28 December 1990 and comes from a family with a strong footballing tradition. His great grandfather, Luís Zabala; his grandfather, Marcos Alonso Imaz, \"Marquitos\"; and his father, Marcos Alonso Peña; were all professional footballers. His father and great grandfather both did do for Barça."
    }
  },
  {
    "id": 18,
    "name": "Jordi Alba",
    "position": "Defender",
    "image": "https://www.fcbarcelona.com/photo-resources/2022/07/01/118e01d4-6d78-4552-9b06-fbae7be231c0/jugador_fitxa-jordi_alba.jpg?width=470&height=470",
    "detail": {
      "appearance": 432,
      "goals": 25,
      "assists": 85,
      "description": "As quick as anyone, Jordi Alba is recognised as one of the most attacking left backs in modern football",
      "bio": "Jordi Alba signed for FC Barcelona on 5 July 2012 after the Club had reached an agreement with Valencia for his transfer. The Catalan defender was 23 when he joined the Club and was the first signing of the 2012/13 season."
    }
  },
  {
    "id": 23,
    "name": "Jules Kounde",
    "position": "Defender",
    "image": "https://www.fcbarcelona.com/photo-resources/2022/08/02/05737327-9fbf-41e3-bcb4-511b278b7139/jugador_fitxa-kounde.jpg?width=470&height=470",
    "detail": {
      "appearance": 5,
      "goals": 0,
      "assists": 3,
      "description": "Jules Kounde is known for being a very fast defender, quick to intercept, and being good on the ball",
      "bio": "Jules Kounde was born in Paris on November 12, 1998. His family originally came from Benin. He started playing for small clubs in the outskirts of Bordeaux in south-eastern France. He first passed a trial at the age of 14 years old and joined the youth ranks of the professional team, FC Girondins de Bordeaux."
    }
  },
  {
    "id": 24,
    "name": "Eric Garcia",
    "position": "Defender",
    "image": "https://www.fcbarcelona.com/photo-resources/2022/07/01/52691a9c-80f9-4200-a907-24f12f6b4623/jugador_fitxa-eric.jpg?width=470&height=470",
    "detail": {
      "appearance": 42,
      "goals": 1,
      "assists": 0,
      "description": "Centre back who excels at getting the ball out from the back and has an instinctive ability to read the game",
      "bio": "Eric Garcia returned to Barça in the summer of 2021 from Manchester City. He originally joined the Barça Escola in 2008 and resided at La Masia until 2017."
    }
  },
  {
    "id": 5,
    "name": "Sergio Busquets",
    "position": "Midfielder",
    "image": "https://www.fcbarcelona.com/photo-resources/2022/07/01/66638e1c-f951-48df-a6f0-4d15d61ab704/jugador_fitxa-sergio.jpg?width=470&height=470",
    "detail": {
      "appearance": 686,
      "goals": 18,
      "assists": 36,
      "description": "Sergio Busquets is probably the best defensive midfielder in the world. He stands out for his technical ability and his unsurpassed reading of the game",
      "bio": "Born in Sabadell, he joined the Barça youth system in the summer of 2005 from Jabac. That season, playing for the U19A side, he won three major trophies alongside the likes of Bojan Krkic, Giovani, Jeffren and Marc Crosas."
    }
  },
  {
    "id": 8,
    "name": "Pedri",
    "position": "Midfielder",
    "image": "https://www.fcbarcelona.com/photo-resources/2022/07/01/41c94cd4-c2d8-40a9-bfea-6714dbd024ab/jugador_fitxa-pedri.jpg?width=470&height=470",
    "detail": {
      "appearance": 82,
      "goals": 10,
      "assists": 7,
      "description": "The player enjoys playing on the front foot, driving at his direct opponent and having his passes break the defensive lines",
      "bio": "On September 2, 2019, FC Barcelona and Las Palmas reached an agreement for the transfer of Pedri. However, the Canarian player didn't join the blaugranes until August 2020. Born in Tegueste, Tenerife, on November 25, 2002, he began his football career in the team from his hometown."
    }
  },
  {
    "id": 19,
    "name": "Franck Kessie",
    "position": "Midfielder",
    "image": "https://www.fcbarcelona.com/photo-resources/2022/07/07/c4aa2d39-e2c2-4bb3-83ab-c53d4f53ec21/jugador_fitxa-kessie.jpg?width=470&height=470",
    "detail": {
      "appearance": 6,
      "goals": 1,
      "assists": 0,
      "description": "A very strong midfielder with a tremendous shot and ability to win the ball back",
      "bio": "A powerful midfielder who is excellent defensively and can get forward and score goals, Franck Kessie was born in Ivory Coast on December 19, 1996. He set out on his football career at Stella Club d'Adjamé in his home country."
    }
  },
  {
    "id": 20,
    "name": "Sergi Roberto",
    "position": "Midfielder",
    "image": "https://www.fcbarcelona.com/photo-resources/2022/07/01/af41b36c-18e8-49ee-8e40-ec32d2c8a464/jugador_fitxa-s_roberto.jpg?width=470&height=470",
    "detail": {
      "appearance": 321,
      "goals": 13,
      "assists": 38,
      "description": "Sergi Roberto is one of the most versatile players in the squad and is known for his ability to get into the box",
      "bio": "When Sergi Roberto was 14 years old he traded the town of Reus for La Masia. The ex-Nàstic Tarragona midfielder improved year after year until he became a crucial player for Luis Enrique's Barça B team."
    }
  },
  {
    "id": 21,
    "name": "Frenkie de Jong",
    "position": "Midfielder",
    "image": "https://www.fcbarcelona.com/photo-resources/2022/07/01/23d0a391-6e78-4d23-9757-4971560591ea/jugador_fitxa-frenkie.jpg?width=470&height=470",
    "detail": {
      "appearance": 148,
      "goals": 14,
      "assists": 15,
      "description": "His versatility, energy and great vision have allowed him to continue developing his skills in any midfield position",
      "bio": "Frenkie de Jong was born in Arkel (Netherlands) on May 12, 1996. The Barça player started his career at Willem II in the Eredivise, the Dutch first division. In 2016 he signed for Ajax, where he gradually gained a place in the starting eleven. His versatility and his great vision allowed him to become the midfield organiser for the team from Amsterdam."
    }
  },
  {
    "id": 30,
    "name": "Gavi",
    "position": "Midfielder",
    "image": "https://www.fcbarcelona.com/photo-resources/2022/09/14/2fb12ba2-961f-499a-9076-339a3e6ff519/jugador_fitxa-gavi.jpg?width=470&height=470",
    "detail": {
      "appearance": 55,
      "goals": 2,
      "assists": 5,
      "description": "Technically gifted midfielder with plenty of character and a good reader of the game",
      "bio": "A combative and technically gifted midfielder Pablo Páez Gavira, better known as 'Gavi', was born in the town of Los Palacios y Villafranca near Seville. As a youngster he made his way to the youth system at Real Betis where he spent two seasons representing the verdiblancos at the Luis del Sol training complex just a stone's throw from the Benito Villamarín stadium."
    }
  },
  {
    "id": 7,
    "name": "Ousmane Dembele",
    "position": "Forward",
    "image": "https://www.fcbarcelona.com/photo-resources/2022/07/18/f0cba433-2e3b-4377-8e7c-2ea75afc8315/jugador_fitxa-dembele.jpg?width=470&height=470",
    "detail": {
      "appearance": 158,
      "goals": 34,
      "assists": 37,
      "description": "The French winger is one of most exciting dribblers in football and thrives on troubling rival defences both for club and country",
      "bio": "At the end of 2014 he signed his first professional contract with French club Rennes. He made his Ligue 1 debut at just the age of 17 and he scored his first goal against Girondins. His progress attracted the attention of Borussia Dortmund and he signed for the Bundesliga club in the summer of 2016. Dembélé adapted quickly to German football, scoring 12 goals and providing 20 assists in his first season."
    }
  },
  {
    "id": 9,
    "name": "Robert Lewandowski",
    "position": "Forward",
    "image": "https://www.fcbarcelona.com/photo-resources/2022/07/24/f47cd134-efc4-4f90-943d-41ad2443d4f1/jugador_fitxa-lewan.jpg?width=470&height=470",
    "detail": {
      "appearance": 8,
      "goals": 11,
      "assists": 2,
      "description": "One of the best strikers ever, the Polish forward's stats speak for themselves",
      "bio": "The striker from Poland stands out for his goalscoring abilities. Inside the box he has all the tools to make him a difficult striker to read as he can find the net with his head and both feet with equal precision."
    }
  },
  {
    "id": 10,
    "name": "Ansu Fati",
    "position": "Forward",
    "image": "https://www.fcbarcelona.com/photo-resources/2022/07/01/b2a278a7-0004-4148-982d-d206011dacf4/jugador_fitxa-ansu.jpg?width=470&height=470",
    "detail": {
      "appearance": 66,
      "goals": 21,
      "assists": 5,
      "description": "Instinct, speed and skill. Ansu Fati is the chosen heir of our number 10",
      "bio": "Anssumane Fati (31 October 2002) was born in Bissau, the capital of Guinea Bissau. The striker moved to Seville at the age of six where he began in the youth team set up at Sevilla. In 2012, at the age of 10, he joined the FC Barcelona youth teams before making his debut with the first team in the 2019/20 season."
    }
  },
  {
    "id": 11,
    "name": "Ferran Torres",
    "position": "Forward",
    "image": "https://www.fcbarcelona.com/photo-resources/2022/07/01/9f4ea993-68d8-45c2-ab5c-d9baa8ebb26b/jugador_fitxa-ferran.jpg?width=470&height=470",
    "detail": {
      "appearance": 33,
      "goals": 8,
      "assists": 7,
      "description": "He brings together various talents which allow him to operate anywhere up front",
      "bio": "Born on 29 February 2000 in Foios (Valencia), Ferran Torres made first contact with the ball at an early age. He started out with futsal at the EPLA school and then attracted the attention of the Valencia CF academy. He was only seven years when he wore the shirt for the first time."
    }
  },
  {
    "id": 14,
    "name": "Memphis Depay",
    "position": "Forward",
    "image": "https://www.fcbarcelona.com/photo-resources/2022/07/01/00d7874b-0d7c-4898-8a10-df731adafcfd/jugador_fitxa-memphis.jpg?width=470&height=470",
    "detail": {
      "appearance": 41,
      "goals": 14,
      "assists": 2,
      "description": "Versatile striker, who not only scores but also likes to contribute to the build-up",
      "bio": "The Dutchman signed for Barça in the summer of 2021 after playing previously in the Eredivisie, Premier League and Ligue 1. Born 3 February 1994 in Moordrecht (Holland), Memphis Depay is more than the usual striker."
    }
  },
  {
    "id": 22,
    "name": "Raphinha",
    "position": "Forward",
    "image": "https://www.fcbarcelona.com/photo-resources/2022/07/24/873308b9-d7fb-4da6-a8d2-000721ef6d4c/jugador_fitxa-raphinha.jpg?width=470&height=470",
    "detail": {
      "appearance": 7,
      "goals": 1,
      "assists": 1,
      "description": "A technically gifted, skill winger with great dribbling skills and combination play",
      "bio": "A technically proficient winger, with good dribbling, decision making and  an appealing and attractive style of play Raphael Dias Belloli (Raphinha) was born on 14 December 1996 in Porto Alegre, Brazil. He joined the Club from Leeds United in summer 2022."
    }
  },
  {
    "id": 0,
    "name": "Xavi Hernandez",
    "position": "Coach",
    "image": "https://www.fcbarcelona.com/photo-resources/2021/11/09/d2b67ae6-98ad-4fc1-8077-fd5ee361c986/1200x750-xavi.png?width=470&height=470",
    "detail": {
      "appearance": 767,
      "goals": 85,
      "assists": 185,
      "description": "Xavi, an absolute legend at FC Barcelona, is a graduate of the FC Barcelona youth system who has gone on to manage the senior team",
      "bio": "Born in Terrassa on 25 January 1980, Xavi Hernández became first team manager in November 2021. Thus began his second spell at FC Barcelona. His first era at the club was a huge success and lasted 24 years; he started as an U12 and progressed all the way up to the first team. He then left Barça for Al Sadd in Qatar and with that experienced learned, he is coming back home."
    }
  }
]
